; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-7)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 roomb)
(at ball4 room3)
(at ball5 room3)
(at ball6 room4)
(at ball7 room5)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 roomb)
(at ball3 room3)
(at ball4 room3)
(at ball5 room4)
(at ball6 room4)
(at ball7 room5)
)
)
)

; plan
1. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 4 of 7
2. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 4 of 7
3. (drop ball2 roomb left)
   deleted: (carry ball2 left)
   added: (at ball2 roomb) (free left)
   goals met: 5 of 7
4. (pick ball3 roomb right)
   deleted: (at ball3 roomb) (free right)
   added: (carry ball3 right)
   goals met: 5 of 7
5. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 5 of 7
6. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 5 of 7
7. (drop ball3 room3 right)
   deleted: (carry ball3 right)
   added: (at ball3 room3) (free right)
   goals met: 6 of 7
8. (pick ball5 room3 left)
   deleted: (at ball5 room3) (free left)
   added: (carry ball5 left)
   goals met: 6 of 7
9. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 6 of 7
10. (drop ball5 room4 left)
   deleted: (carry ball5 left)
   added: (at ball5 room4) (free left)
   goals met: 7 of 7
